#+title: Literate Config
#+startup: fold
* Basic things
:PROPERTIES:
:header-args: :tangle ~/.doom.d/config.el
:END:
#+begin_src elisp
(setq user-full-name "Luis Camacho"
      user-mail-address "camacho.luis@protonmail.com")
#+end_src

#+RESULTS:
: camacho.luis@protonmail.com

I don't like custom.el >:(
#+begin_src elisp
(setq custom-file "/dev/null")
#+end_src
*** [[https://orgmode.org/worg/org-tutorials/org-custom-agenda-commands.html][Custom commands]]
#+begin_src elisp
(setq org-agenda-custom-commands
      '(("n" "Main agenda"
         ((agenda "" ((org-agenda-span 31)
                      (org-agenda-include-diary nil)
                      ))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        '((:name "Due Soon"
                                 :deadline future
                                 :order 8)
                          (:name "Overdue"
                                 :deadline past
                                 :order 7)
                          (:name "University"
                                 :order 1
                                 :tag "@uni")
                          (:name "BEST"
                                 :order 2
                                 :tag "@BEST")
                          (:name "Monthly objectives"
                                 :order 19
                                 :and (:tag "@objective"
                                       :tag "@monthly"))
                          (:name "Buying List"
                                 :order 50
                                 :and (:tag "buy"
                                      :not (:and (:children todo
                                                   :todo "[-]"))))
                          (:name "Main Recommendations"
                                 :order 51
                                 :and (:tag "recommendation"
                                       :not (:and (:children todo
                                                   :todo "[-]"))))
                          (:discard
                                (:and (:tag ("@objective" "recommendation"))))

                          )))))
         nil
         ("~/org/calendar.ics"))
        ("o" "Objectives"
         alltodo "" ((org-agenda-overriding-header "Objectives")
                     (org-agenda-dim-blocked-tasks nil)
                     (org-agenda-files (append org-agenda-files (list (concat org-directory "projects.org"))))
                     (org-super-agenda-groups
                      '((:name "Monthly objectives"
                               :order 1
                               :tag "@monthly")
                        (:name "Main objectives"
                               :order 2
                               :and (:tag "@objective"
                                     :tag "main"))
                        (:name "Miscellaneous todos"
                               :order 10
                               :and (:todo ("TODO" "CHORE" "TASK")
                                     :not (:tag ("@routine" "@objective"))))
                        (:discard :anything)))))

        ("W" "Daily Chores"
         ((agenda "" ((org-agenda-span 1)
                      ;(org-agenda-files (append org-agenda-files (directory-files org-roam-dailies-directory t directory-files-no-dot-files-regexp)))
                      (org-agenda-overriding-header "")
                      ;(org-agenda-files (directory-files org-roam-dailies-directory t directory-files-no-dot-files-regexp))
                      (org-agenda-start-day "0d")
                      (org-agenda-skip-timestamp-if-done nil)
                      (org-agenda-skip-scheduled-if-done nil)
                      (org-agenda-sorting-strategy '(time-up deadline-up scheduled-up ts-up priority-down habit-down))
                      (org-agenda-remove-tags 't)
                      (org-agenda-scheduled-leaders '("[Scheduled] " "Sched.%2dx: "))
                      (org-agenda-deadline-leaders '("[Deadline] " "In %2d d.: " "%2d d. ago: "))

                      (org-agenda-time-grid
                        '((daily today require-timed remove-match)
                          (700 900 1100 1300 1500 1700 1900 2100 2300)
                          " ┄┄┄┄┄" "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄"))
                      (org-agenda-show-current-time-in-grid nil)
                      (org-super-agenda-groups
                       '(
                         (:name ""
                               :time-grid t
                               :date today
                               :order 1)
                         (:name "Incoming"
                               :and (:deadline t)
                                     ;:not (:todo ("DONE" "FINISHED" "[V]" "[X]")))
                               :order 7)
                         (:discard :anything)
                      ))))
          (alltodo "" ((org-agenda-span 21)
                     (org-agenda-overriding-header "")
                     (org-agenda-start-day "+0d")
                     (org-agenda-sorting-strategy '(time-up deadline-up scheduled-up ts-up habit-down))
                     (org-agenda-remove-tags 't)
                     (org-agenda-block-separator nil)
                     (org-agenda-todo-keyword-format "")
                     (org-agenda-prefix-format '((todo . " ◎ ")))
                     (org-super-agenda-groups
                      '((:name "Miscellaneous todos"
                               :order 9
                               :and (:todo ("TODO" "CHORE" "TASK")
                                     :not (:tag ("@routine" "@objective"))))
                        (:name "Scheduled"
                               :scheduled t
                               :order 7)
                        (:discard (:anything))
                        ))))))
        ))
#+end_src

#+RESULTS:
| n | Main agenda  | ((agenda  ((org-agenda-span 31) (org-agenda-include-diary nil))) (alltodo  ((org-agenda-overriding-header ) (org-super-agenda-groups '((:name Due Soon :deadline future :order 8) (:name Overdue :deadline past :order 7) (:name University :order 1 :tag @uni) (:name BEST :order 2 :tag @BEST) (:name Monthly objectives :order 19 :and (:tag @objective :tag @monthly)) (:name Buying List :order 50 :and (:tag buy :not (:and (:children todo :todo [-])))) (:name Main Recommendations :order 51 :and (:tag recommendation :not (:and (:children todo :todo [-])))) (:discard (:and (:tag (@objective recommendation))))))))) | nil | (~/org/calendar.ics)                                                                                                                                                                                                 |
| o | Objectives   | alltodo                                                                                                                                                                                                              |     | ((org-agenda-overriding-header Objectives) (org-agenda-dim-blocked-tasks nil) (org-agenda-files (append org-agenda-files (list (concat org-directory projects.org)))) (org-super-agenda-groups '((:name Monthly objectives :order 1 :tag @monthly) (:name Main objectives :order 2 :and (:tag @objective :tag main)) (:name Miscellaneous todos :order 10 :and (:todo (TODO CHORE TASK) :not (:tag (@routine @objective)))) (:discard :anything)))) |
| W | Daily Chores | ((agenda  ((org-agenda-span 1) (org-agenda-overriding-header ) (org-agenda-start-day 0d) (org-agenda-skip-timestamp-if-done nil) (org-agenda-skip-scheduled-if-done nil) (org-agenda-sorting-strategy '(time-up deadline-up scheduled-up ts-up priority-down habit-down)) (org-agenda-remove-tags 't) (org-agenda-scheduled-leaders '([Scheduled]  Sched.%2dx: )) (org-agenda-deadline-leaders '([Deadline]  In %2d d.:  %2d d. ago: )) (org-agenda-time-grid '((daily today require-timed remove-match) (700 900 1100 1300 1500 1700 1900 2100 2300)  ┄┄┄┄┄ ┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄)) (org-agenda-show-current-time-in-grid nil) (org-super-agenda-groups '((:name  :time-grid t :date today :order 1) (:name Incoming :and (:deadline t) :order 7) (:discard :anything))))) (alltodo  ((org-agenda-span 21) (org-agenda-overriding-header ) (org-agenda-start-day +0d) (org-agenda-sorting-strategy '(time-up deadline-up scheduled-up ts-up habit-down)) (org-agenda-remove-tags 't) (org-agenda-block-separator nil) (org-agenda-todo-keyword-format ) (org-agenda-prefix-format '((todo .  ◎ ))) (org-super-agenda-groups '((:name Miscellaneous todos :order 9 :and (:todo (TODO CHORE TASK) :not (:tag (@routine @objective)))) (:name Scheduled :scheduled t :order 7) (:discard (:anything))))))) |     |                                                                                                                                                                                                                      |

#+begin_src elisp
         ;; agenda "" ((org-agenda-span 1)
         ;;            (org-agenda-overriding-header "Today's Agenda")
         ;;            (org-agenda-files (append org-agenda-files (directory-files org-roam-dailies-directory t directory-files-no-dot-files-regexp)))
         ;;            (org-agenda-start-day "+0d")
         ;;            (org-agenda-remove-tags 't)
         ;;            )
         ;;        ("~/agenda"))
      ;; '(("n" "Agenda and all TODOs"
      ;;    ((agenda "")
      ;;     (alltodo "")))
      ;;  ("o" "Personal projects and objectives" tags-todo "@objectives"
      ;;    ((agenda "")
      ;;     (alltodo "")))
      ;;  ("u" "University" tags "@uni"
      ;;    ((agenda "")
      ;;     (alltodo "")))
      ;;  ("b" "BEST" tags "@BEST"
      ;;    ((agenda "")
      ;;     (alltodo "")))
      ;;  ("l" "Shopping list" alltodo ""
      ;;    ((org-agenda-files '("~/org/journal/shopping list.org"))))
       ;JUST TO SEE WHAT ORG-AGENDA CAN DO
       ;; ("P" "Printed agenda"
       ;;   ((agenda "" ((org-agenda-span 7)                      ;; overview of appointments
       ;;                (org-agenda-start-on-weekday nil)         ;; calendar begins today
       ;;                (org-agenda-repeating-timestamp-show-all t)
       ;;                (org-agenda-entry-types '(:timestamp :sexp))))
       ;;    (agenda "" ((org-agenda-span 1)                      ; daily agenda
       ;;                (org-deadline-warning-days 7)            ; 7 day advanced warning for deadlines
       ;;                (org-agenda-todo-keyword-format "[ ]")
       ;;                (org-agenda-scheduled-leaders '("" ""))
       ;;                (org-agenda-prefix-format "%t%s")))
       ;;    (todo "TODO"                                          ;; todos sorted by context
       ;;          ((org-agenda-prefix-format "[ ] %T: ")
       ;;           (org-agenda-sorting-strategy '(tag-up priority-down))
       ;;           (org-agenda-todo-keyword-format "")
       ;;           (org-agenda-overriding-header "\nTasks by Context\n------------------\n"))))
       ;;   ((org-agenda-with-colors nil)
       ;;    (org-agenda-compact-blocks t)
       ;;    (org-agenda-remove-tags t)
       ;;    (ps-number-of-columns 2)
       ;;     (ps-landscape-mode t))
       ;;   ("~/agenda.ps"))
       ;;  other commands go here
#+end_src

** org-latex
#+begin_src elisp
(defun my/text-scale-adjust-latex-previews ()
  "Adjust the size of latex preview fragments when changing the
buffer's text scale."
  (pcase major-mode
    ('latex-mode
     (dolist (ov (overlays-in (point-min) (point-max)))
       (if (eq (overlay-get ov 'category)
               'preview-overlay)
           (my/text-scale--resize-fragment ov))))
    ('org-mode
     (dolist (ov (overlays-in (point-min) (point-max)))
       (if (eq (overlay-get ov 'org-overlay-type)
               'org-latex-overlay)
           (my/text-scale--resize-fragment ov))))))

(defun my/text-scale--resize-fragment (ov)
  (overlay-put
   ov 'display
   (cons 'image
         (plist-put
          (cdr (overlay-get ov 'display))
          :scale (+ 1.0 (* 0.25 text-scale-mode-amount))))))

(add-hook 'text-scale-mode-hook #'my/text-scale-adjust-latex-previews)
#+end_src

#+RESULTS:
| my/text-scale-adjust-latex-previews |

** hl-todo
#+begin_src elisp
;; IMPROVE Asignar colores según función
(after! hl-todo
    (setq hl-todo-keyword-faces
        '(
        ("TODO" . "#fe6323")
        ("DONE" . "#ff889f")
        ("DONT" . "#f0f040")
        ("HOLD" . "#f0ff8f")
        ("NEXT" . "#1ca3a3")
        ("PROG" . "#7cb8bb")
        ("OKAY" . "#7cf8bb")
        ("FAIL" . "#8c5353")
        ("FIXME"  . "#ff0000")
        ("FIXING"  . "#bff302")
        ("FIXED"  . "#ff33b3")
        ("REMOVE"  . "#909ff3")
        ("DEBUG"  . "#1f9333")
        ("IMPROVE" . "#7040f1")
        ("NOTE"   . "#2fc100")
        ("KLUDGE" . "#d0bf8f")
        ("HACK"   . "#900f9f")
        ("TEMP"   . "#308f8f")
        ("XXX"  . "#cc9393"))))
#+end_src

#+RESULTS:
: ((TODO . #fe6323) (DONE . #ff889f) (DONT . #f0f040) (HOLD . #f0ff8f) (NEXT . #1ca3a3) (PROG . #7cb8bb) (OKAY . #7cf8bb) (FAIL . #8c5353) (FIXME . #ff0000) (FIXING . #bff302) (FIXED . #ff33b3) (REMOVE . #909ff3) (DEBUG . #1f9333) (IMPROVE . #3020f1) (NOTE . #2fc100) (KLUDGE . #d0bf8f) (HACK . #900f9f) (TEMP . #308f8f) (XXX . #cc9393))
